# SQL Subqueries - Lab Assignment #2

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database ERD

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="img/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database `data2.sqlite` in the data folder.

In [22]:
# Your code here; import the necessary packages
import sqlite3

# Connect to the database
conn = sqlite3.connect('data/data2.sqlite')

In [23]:
# Your code here; create the connection
import sqlite3

# Connect to the database
conn = sqlite3.connect('data/data2.sqlite')

# Create a cursor object to execute SQL queries
cur = conn.cursor()

# Now you're ready to write and execute your SQL queries

# Don't forget to close the connection when you're done
conn.close()

## Write an Equivalent Query using a Subquery

The following query works using a `JOIN`. Rewrite it so that it uses a subquery instead.

```
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
JOIN orders 
    USING(customerNumber)
WHERE orderDate = '2003-01-31'
;
```

In [28]:
import sqlite3

# Connect to the database
conn = sqlite3.connect('data/data2.sqlite')

# Create a cursor object to execute SQL queries
cur = conn.cursor()

# Your code here
query = """
    SELECT 
        customerNumber,
        contactLastName,
        contactFirstName
    FROM customers
    WHERE customerNumber IN (
        SELECT customerNumber
        FROM orders
        WHERE orderDate = '2003-01-31'
    );
"""

# Execute the query using the cursor
cur.execute(query)

# Fetch the results if needed
results = cur.fetchall()

# Print or process the results as necessary
print(results)

[(141, 'Freyre', 'Diego ')]

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [6]:
# Your code here
query = """
    SELECT 
        productName,
        COUNT(orderNumber) AS totalOrders,
        SUM(quantityOrdered) AS totalItemsSold
    FROM products
    JOIN orderdetails 
        USING(productCode)
    GROUP BY productName
    ORDER BY totalItemsSold DESC;
"""
# Execute the query using the cursor
cur.execute(query)

# Fetch the results if needed
results = cur.fetchall()

# Print or process the results as necessary
print(results)

[('1992 Ferrari 360 Spider red', 53, 1808), ('1937 Lincoln Berline', 28, 1111), ('American Airlines: MD-11S', 28, 1085), ('1941 Chevrolet Special Deluxe Cabriolet', 28, 1076), ('1930 Buick Marquette Phaeton', 28, 1074), ('1940s Ford truck', 28, 1061), ('1969 Harley Davidson Ultimate Chopper', 28, 1057), ('1957 Chevy Pickup', 28, 1056), ('1964 Mercedes Tour Bus', 28, 1053), ('1956 Porsche 356A Coupe', 27, 1052), ('Corsair F4U ( Bird Cage)', 28, 1051), ('F/A 18 Hornet 1/72', 28, 1047), ('1980s Black Hawk Helicopter', 28, 1040), ('1913 Ford Model T Speedster', 28, 1038), ('1997 BMW R 1100 S', 28, 1033), ('1972 Alfa Romeo GTA', 28, 1030), ('1962 Volkswagen Microbus', 28, 1029), ('2002 Suzuki XREO', 28, 1028), ('The USS Constitution Ship', 27, 1020), ('2001 Ferrari Enzo', 27, 1019), ('1960 BSA Gold Star DBD34', 28, 1015), ('1997 BMW F650 ST', 28, 1014), ('1957 Corvette Convertible', 27, 1013), ('18th century schooner', 27, 1011), ('1900s Vintage Tri-Plane', 28, 1009), ('1996 Moto Guzzi 1100i', 28, 999), ('1940 Ford Pickup Truck', 28, 999), ('1926 Ford Fire Engine', 28, 998), ('1982 Camaro Z28', 28, 997), ('1939 Cadillac Limousine', 28, 995), ('2002 Yamaha YZR M1', 27, 992), ('1969 Dodge Charger', 27, 992), ('1917 Maxwell Touring Car', 28, 992), ('1912 Ford Model T Delivery Wagon', 27, 991), ('1904 Buick Runabout', 27, 990), ('1996 Peterbilt 379 Stake Bed with Outrigger', 28, 988), ('1998 Chrysler Plymouth Prowler', 28, 986), ('2003 Harley-Davidson Eagle Drag Bike', 28, 985), ('1934 Ford V8 Coupe', 28, 985), ('America West Airlines B757-200', 28, 984), ('1958 Chevy Corvette Limited Edition', 28, 983), ('1936 Chrysler Airflow', 28, 983), ('Diamond T620 Semi-Skirted Tanker', 28, 979), ('1970 Dodge Coronet', 28, 976), ('1969 Dodge Super Bee', 27, 974), ('ATA: B757-300', 28, 973), ('1958 Setra Bus', 28, 972), ('1948 Porsche 356-A Roadster', 27, 972), ('1928 Ford Phaeton Deluxe', 28, 972), ('1928 British Royal Navy Airplane', 28, 972), ('1971 Alpine Renault 1600s', 27, 969), ('1999 Yamaha Speed Boat', 28, 966), ('1962 City of Detroit Streetcar', 27, 966), ('1969 Ford Falcon', 27, 965), ('1969 Corvair Monza', 27, 963), ('1952 Alpine Renault 1300', 28, 961), ('Boeing X-32A JSF', 28, 960), ('1936 Mercedes-Benz 500K Special Roadster', 28, 960), ('1957 Vespa GS150', 27, 959), ('Pont Yacht', 27, 958), ('1932 Model A Ford J-Coupe', 28, 957), ('1954 Greyhound Scenicruiser', 28, 955), ('1938 Cadillac V-16 Presidential Limousine', 28, 955), ('The Titanic', 27, 952), ('1949 Jaguar XK 120', 25, 949), ('1948 Porsche Type 356 Roadster', 25, 948), ('1993 Mazda RX-7', 27, 947), ('1982 Ducati 900 Monster', 27, 947), ('1970 Triumph Spitfire', 27, 945), ('1936 Harley Davidson El Knucklehead', 28, 945), ('1961 Chevrolet Impala', 27, 941), ('1900s Vintage Bi-Plane', 28, 940), ('1939 Chevrolet Deluxe Coupe', 28, 937), ('The Schooner Bluenose', 27, 934), ("1950's Chicago Surface Lines Streetcar", 27, 934), ('1968 Ford Mustang', 27, 933), ('1962 LanciaA Delta 16V', 28, 932), ('1968 Dodge Charger', 27, 925), ('1940 Ford Delivery Sedan', 28, 923), ('Collectable Wooden Train', 27, 918), ('1917 Grand Touring Sedan', 25, 918), ('P-51-D Mustang', 28, 917), ('1995 Honda Civic', 27, 917), ('1976 Ford Gran Torino', 27, 915), ('1966 Shelby Cobra 427 S/C', 25, 915), ('1965 Aston Martin DB5', 25, 914), ('1982 Lamborghini Diablo', 27, 912), ('1980’s GM Manhattan Express', 28, 911), ('18th Century Vintage Horse Carriage', 28, 907), ('1982 Ducati 996 R', 27, 906), ('1970 Plymouth Hemi Cuda', 27, 900), ('The Mayflower', 27, 898), ('1974 Ducati 350 Mk3 Desmo', 27, 898), ('HMS Bounty', 28, 897), ('The Queen Mary', 27, 896), ('American Airlines: B767-300', 28, 894), ('2002 Chevy Corvette', 25, 894), ('1937 Horch 930V Limousine', 28, 884), ('1903 Ford Model A', 27, 883), ('1928 Mercedes-Benz SSK', 28, 880), ('1952 Citroen-15CV', 24, 873), ('1969 Chevrolet Camaro Z28', 25, 870), ('1992 Porsche Cayenne Turbo Silver', 27, 867), ('1932 Alfa Romeo 8C2300 Spider Sport', 25, 866), ('1999 Indy 500 Monte Carlo SS', 25, 855), ('1911 Ford Town Car', 25, 832), ('1936 Mercedes Benz 500k Roadster', 25, 824), ('1970 Chevy Chevelle SS 454', 25, 803), ('1957 Ford Thunderbird', 24, 767)]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [9]:
# Your code here
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT
import sqlite3

# Connect to the database
conn = sqlite3.connect('data/data2.sqlite')

# Create a cursor object to execute SQL queries
cur = conn.cursor()

query = """
    SELECT 
        productName,
        COUNT(DISTINCT customerNumber) AS totalPeopleOrdered
    FROM products
    JOIN orderdetails 
        USING(productCode)
    JOIN orders 
        USING(orderNumber)
    GROUP BY productName
    ORDER BY totalPeopleOrdered DESC;
"""

# Execute the query using the cursor
cur.execute(query)

# Fetch the results if needed
results = cur.fetchall()

# Print or process the results as necessary
print(results)

[('1992 Ferrari 360 Spider red', 40), ('Boeing X-32A JSF', 27), ('1972 Alfa Romeo GTA', 27), ('1952 Alpine Renault 1300', 27), ('1934 Ford V8 Coupe', 27), ('HMS Bounty', 26), ('Corsair F4U ( Bird Cage)', 26), ('American Airlines: MD-11S', 26), ('1999 Yamaha Speed Boat', 26), ('1996 Moto Guzzi 1100i', 26), ('1995 Honda Civic', 26), ('1980s Black Hawk Helicopter', 26), ('1969 Harley Davidson Ultimate Chopper', 26), ('1941 Chevrolet Special Deluxe Cabriolet', 26), ('1940 Ford Delivery Sedan', 26), ('1937 Horch 930V Limousine', 26), ('1913 Ford Model T Speedster', 26), ('1900s Vintage Bi-Plane', 26), ('18th Century Vintage Horse Carriage', 26), ('America West Airlines B757-200', 25), ('ATA: B757-300', 25), ('2003 Harley-Davidson Eagle Drag Bike', 25), ('2002 Suzuki XREO', 25), ('1997 BMW R 1100 S', 25), ('1993 Mazda RX-7', 25), ('1962 LanciaA Delta 16V', 25), ('1960 BSA Gold Star DBD34', 25), ('1948 Porsche 356-A Roadster', 25), ('1940s Ford truck', 25), ('1940 Ford Pickup Truck', 25), ('1937 Lincoln Berline', 25), ('1936 Mercedes-Benz 500K Special Roadster', 25), ('1936 Harley Davidson El Knucklehead', 25), ('1912 Ford Model T Delivery Wagon', 25), ('The Queen Mary', 24), ('Pont Yacht', 24), ('P-51-D Mustang', 24), ('F/A 18 Hornet 1/72', 24), ('2002 Yamaha YZR M1', 24), ('1997 BMW F650 ST', 24), ('1969 Dodge Charger', 24), ('1939 Chevrolet Deluxe Coupe', 24), ('1936 Chrysler Airflow', 24), ('1932 Model A Ford J-Coupe', 24), ('1917 Maxwell Touring Car', 24), ('1917 Grand Touring Sedan', 24), ('18th century schooner', 24), ('The USS Constitution Ship', 23), ('The Schooner Bluenose', 23), ('American Airlines: B767-300', 23), ('2001 Ferrari Enzo', 23), ('1996 Peterbilt 379 Stake Bed with Outrigger', 23), ('1980’s GM Manhattan Express', 23), ('1974 Ducati 350 Mk3 Desmo', 23), ('1970 Plymouth Hemi Cuda', 23), ('1968 Ford Mustang', 23), ('1958 Setra Bus', 23), ('1939 Cadillac Limousine', 23), ('1938 Cadillac V-16 Presidential Limousine', 23), ('1932 Alfa Romeo 8C2300 Spider Sport', 23), ('1930 Buick Marquette Phaeton', 23), ('1928 Ford Phaeton Deluxe', 23), ('1926 Ford Fire Engine', 23), ('1911 Ford Town Car', 23), ('The Titanic', 22), ('The Mayflower', 22), ('Diamond T620 Semi-Skirted Tanker', 22), ('1982 Ducati 900 Monster', 22), ('1982 Camaro Z28', 22), ('1971 Alpine Renault 1600s', 22), ('1969 Ford Falcon', 22), ('1969 Corvair Monza', 22), ('1968 Dodge Charger', 22), ('1965 Aston Martin DB5', 22), ('1964 Mercedes Tour Bus', 22), ('1962 City of Detroit Streetcar', 22), ('1961 Chevrolet Impala', 22), ('1956 Porsche 356A Coupe', 22), ("1950's Chicago Surface Lines Streetcar", 22), ('1928 British Royal Navy Airplane', 22), ('1904 Buick Runabout', 22), ('1900s Vintage Tri-Plane', 22), ('1999 Indy 500 Monte Carlo SS', 21), ('1998 Chrysler Plymouth Prowler', 21), ('1982 Lamborghini Diablo', 21), ('1982 Ducati 996 R', 21), ('1970 Triumph Spitfire', 21), ('1969 Dodge Super Bee', 21), ('1966 Shelby Cobra 427 S/C', 21), ('1962 Volkswagen Microbus', 21), ('1957 Vespa GS150', 21), ('1957 Corvette Convertible', 21), ('1957 Chevy Pickup', 21), ('1948 Porsche Type 356 Roadster', 21), ('1936 Mercedes Benz 500k Roadster', 21), ('1928 Mercedes-Benz SSK', 21), ('1903 Ford Model A', 21), ('Collectable Wooden Train', 20), ('1992 Porsche Cayenne Turbo Silver', 20), ('1976 Ford Gran Torino', 20), ('1970 Dodge Coronet', 20), ('1970 Chevy Chevelle SS 454', 20), ('1957 Ford Thunderbird', 20), ('1954 Greyhound Scenicruiser', 20), ('1958 Chevy Corvette Limited Edition', 19), ('2002 Chevy Corvette', 18), ('1969 Chevrolet Camaro Z28', 18), ('1952 Citroen-15CV', 18), ('1949 Jaguar XK 120', 18)]

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products That Have Been Ordered by Fewer Than 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [10]:
# Your code here
import sqlite3

# Connect to the database
conn = sqlite3.connect('data/data2.sqlite')

# Create a cursor object to execute SQL queries
cur = conn.cursor()

query = """
    SELECT DISTINCT
        employees.employeeNumber,
        employees.firstName,
        employees.lastName,
        offices.city,
        offices.officeCode
    FROM employees
    JOIN offices
        USING(officeCode)
    JOIN customers
        ON employees.employeeNumber = customers.salesRepEmployeeNumber
    JOIN orders
        USING(customerNumber)
    JOIN orderdetails
        USING(orderNumber)
    JOIN products
        USING(productCode)
    WHERE products.productCode IN (
        SELECT productCode
        FROM orderdetails
        JOIN orders
            USING(orderNumber)
        GROUP BY productCode
        HAVING COUNT(DISTINCT customerNumber) < 20
    );
"""

# Execute the query using the cursor
cur.execute(query)

# Fetch the results if needed
results = cur.fetchall()

# Print or process the results as necessary
print(results)

[(1501, 'Larry', 'Bott', 'London', 7), (1166, 'Leslie', 'Thompson', 'San Francisco', 1), (1612, 'Peter', 'Marsh', 'Sydney', 6), (1611, 'Andy', 'Fixter', 'Sydney', 6), (1401, 'Pamela', 'Castillo', 'Paris', 4), (1323, 'George', 'Vanauf', 'NYC', 3), (1165, 'Leslie', 'Jennings', 'San Francisco', 1), (1216, 'Steve', 'Patterson', 'Boston', 2), (1286, 'Foon Yue', 'Tseng', 'NYC', 3), (1370, 'Gerard', 'Hernandez', 'Paris', 4), (1337, 'Loui', 'Bondur', 'Paris', 4), (1621, 'Mami', 'Nishi', 'Tokyo', 5), (1702, 'Martin', 'Gerard', 'Paris', 4), (1188, 'Julie', 'Firrelli', 'Boston', 2), (1504, 'Barry', 'Jones', 'London', 7)]

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit Over 15K

In [11]:
# Your code here
import sqlite3

# Connect to the database
conn = sqlite3.connect('data/data2.sqlite')

# Create a cursor object to execute SQL queries
cur = conn.cursor()

query = """
    SELECT
        employees.employeeNumber,
        employees.firstName,
        employees.lastName,
        COUNT(DISTINCT customers.customerNumber) AS numberOfCustomers
    FROM employees
    JOIN customers
        ON employees.employeeNumber = customers.salesRepEmployeeNumber
    WHERE customers.creditLimit > 15000
    GROUP BY employees.employeeNumber, employees.firstName, employees.lastName
    HAVING AVG(customers.creditLimit) > 15000;
"""

# Execute the query using the cursor
cur.execute(query)

# Fetch the results if needed
results = cur.fetchall()

# Print or process the results as necessary
print(results)

[(1165, 'Leslie', 'Jennings', 6), (1166, 'Leslie', 'Thompson', 5), (1188, 'Julie', 'Firrelli', 6), (1216, 'Steve', 'Patterson', 6), (1286, 'Foon Yue', 'Tseng', 6), (1323, 'George', 'Vanauf', 8), (1337, 'Loui', 'Bondur', 6), (1370, 'Gerard', 'Hernandez', 7), (1401, 'Pamela', 'Castillo', 10), (1501, 'Larry', 'Bott', 8), (1504, 'Barry', 'Jones', 9), (1611, 'Andy', 'Fixter', 5), (1612, 'Peter', 'Marsh', 5), (1621, 'Mami', 'Nishi', 5), (1702, 'Martin', 'Gerard', 5)]

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!